Тест_ЗУП_31_КОРП/src/Documents/НачальнаяЗадолженностьПоЗарплате/НачальнаяЗадолженностьПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачальнаяЗадолженностьПоЗарплате</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.БухгалтерскиеВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаКВыплате</registerRecords>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаЗадолженности</name>
    <type>
      <types>EnumRef.СпособВводаЗадолженностиПоЗарплате</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗадолженностьПоЗарплате</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяФинансирования</name>
      <type>
        <types>CatalogRef.СтатьиФинансированияЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>CatalogRef.СтатьиРасходовЗарплата</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоБухучету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыплатыЗаПрошлыеПериоды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/СпособВводаЗадолженностиПоЗарплате/СпособВводаЗадолженностиПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособВводаЗадолженностиПоЗарплате</name>
  <enumValues>
    <name>ОстатокНевыплаченнойЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскоеСальдоИВыплаты</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/НачальнаяЗадолженностьПоЗарплате/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаДокумента() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.НачальнаяЗадолженностьПоЗарплате;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаДокументаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Заполняет реквизит СпособВводаЗадолженности при обновлении ИБ.
//
// Параметры:
//  ПараметрыОбновления	 - Структура - Стандартная структура для обработчика обновления с режимом выполнения "Отложенно".
//
Процедура ЗаполнитьСпособВводаЗадолженности(ПараметрыОбновления) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	НачальнаяЗадолженностьПоЗарплате.Ссылка КАК Ссылка,
	|	НачальнаяЗадолженностьПоЗарплате.СпособВводаЗадолженности КАК СпособВводаЗадолженности
	|ИЗ
	|	Документ.НачальнаяЗадолженностьПоЗарплате КАК НачальнаяЗадолженностьПоЗарплате
	|ГДЕ
	|	НачальнаяЗадолженностьПоЗарплате.СпособВводаЗадолженности = ЗНАЧЕНИЕ(Перечисление.СпособВводаЗадолженностиПоЗарплате.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	Иначе 
		ПараметрыОбновления.ОбработкаЗавершена = Ложь;
		Результат = РезультатЗапроса.Выгрузить();
		Для Каждого ТекущийДокумент Из Результат Цикл 
			ДокументОбъект = ТекущийДокумент.Ссылка.ПолучитьОбъект();
			ДокументОбъект.СпособВводаЗадолженности = Перечисления.СпособВводаЗадолженностиПоЗарплате.ОстатокНевыплаченнойЗарплаты;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
